//Форматированный ввод/вывод (2)

#include <iostream>

using namespace std;

int main(int argc, char* argv[]){

cout << "website:" << endl << "cppstudio.com";//Переход на новую строку при выводе
/*
bool log_true = 1;//Вывод   логических величин в текстовомвиде (true, false)
cout << boolalpha << log_true << endl;

bool log_true = true;//Вывод   логических величин в числовом виде (true, false)
cout << noboolalpha << log_true << endl;

int value = 64;//Вывод   величин   в восьмеричной системе   счисления
cout << oct << value << endl;

int value = 64;//Вывод   величин   в десятичной   системе счисления   (по умолчанию)
cout << dec << value << endl;

int value = 64;//Вывод   величин   в шестнадцатеричной системе   счисления
cout << hex << value << endl;

int value = 64;//Выводить индикатор основания   системы счисления
cout << showbase << hex << value << endl;

int value = 64;//Не выводить индикатор основания   системы счисления (по умолчанию).
cout << noshowbase << hex << value << endl;

int value = 255;//В шестнадцатеричной системе счисления использовать буквы верхнего регистра (по умолчанию установлены буквы нижнего регистра).
cout << uppercase << hex << value << endl;

int value = 255;//В шестнадцатеричной системе счисления использовать буквы нижнего регистра (по умолчанию).
cout << nouppercase << hex << value << endl;

int value = 255;//Вывод знака плюс + для положительных чисел
cout << showpos<< value << endl;

int value = 255;//Не выводить знак плюс + для положительных чисел (по умолчанию).
cout <<noshowpos<< value << endl;

double value = 1024.165;//Вывод чисел с плавающей точкой в экспоненциальной форме
cout << scientific << value << endl;

double value = 1024.165;//Вывод чисел с плавающей точкой в фиксированной форме (по умолчанию).
cout << fixed << value << endl;

cout << setw(40) << «cppstudio.com» << endl;//Установить ширину поля, где number — количество позиций, символов (выравнивание по умолчанию по правой границе). Манипулятор с параметром.

cout << setw(40) << right << «cppstudio.com» << endl;//Выравнивание по правой границе(по умолчанию). Сначала необходимо установить ширину поля(ширина поля должна быть заведомо большей чем, длина выводимой строки).

cout << setw(40) << left << «cppstudio.com» << endl;//Выравнивание по левой границе. Сначала необходимо установить ширину поля(ширина поля должна быть заведомо большей чем, длина выводимой строки).

cout << fixed << setprecision(3) << (13.5 / 2) << endl;//Задаёт количество знаков после запятой, где count — количество знаков после десятичной точки

cout << setfill(‘0′) << setw(4) << 15 << ends << endl;//Установить символ заполнитель. Если ширина поля больше, чем выводимая величина, то свободные места поля будут наполняться символом symbol — символ заполнитель
*/
}
