//Приоритет операций
/*1) 
:: - разрешение области действия 
[] - операция идексирования
() - круглые скобки
. - обращение к члену структуры класса
-> - обращение к члену структуры или класса через указатель
2)
++ - пост инкремент
-- - потс декремент
3)
++ - пре инкремент
-- - пре декримент
4)
* - умножение
/ - деление
% - остаток от деления
5)
+ - сложить
- - вычесть
6)
>> - сдвиг направо
<< - сдвиг налево
7)
<
<=
>
>=
8)
==
!=
9)
&&
10)
||
11)
?: - тенарная операция
12)
=
*=
/=
%=
+=
-=
13)
,
*/
